programming/20230305163152-introduction_to_datastructures.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-07-12 Wed 21:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>introduction to data structures</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/static/org.css" />
</head>
<body>
<div id="preamble" class="status">
<nav class="navbar">
  <div class="navbar-mode-line">
    <a href="/" class="navbar-circle">◉</a>
    <a href="/programming" class="navbar-filename">programming</a>
    <a href="/hacking" class="navbar-filename">hacking</a>
    <a href="/Tutorial" class="navbar-filename">Tutorials</a>
    <a href="/posts.html" class="navbar-filename">All Posts</a>
  </div>
</nav>
</div>
<div id="content" class="content">
<h1 class="title">introduction to data structures</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgac1cb29">When data becomes information</a></li>
<li><a href="#org6c9bf9c">Data types v Abstract data types</a>
<ul>
<li><a href="#org9d23841">Data type</a></li>
<li><a href="#org979139f">Abstract Data Types (ADT)</a>
<ul>
<li><a href="#org556f703">A stack ADT</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgac1cb29" class="outline-2">
<h2 id="orgac1cb29">When data becomes information</h2>
<div class="outline-text-2" id="text-orgac1cb29">
<p>
If data is arrange in a systematic way then it gets a structure and becomes meaningful.
</p>
</div>
</div>



<div id="outline-container-org6c9bf9c" class="outline-2">
<h2 id="org6c9bf9c">Data types v Abstract data types</h2>
<div class="outline-text-2" id="text-org6c9bf9c">
</div>
<div id="outline-container-org9d23841" class="outline-3">
<h3 id="org9d23841">Data type</h3>
<div class="outline-text-3" id="text-org9d23841">
<p>
A data type defines a certain domain of values and it defines what operations can be done ith it.
Example in nim you can add and subtract ints, basicly primitive types
</p>

<p>
User types are types that you me or user of a language would define.
</p>
</div>
</div>

<div id="outline-container-org979139f" class="outline-3">
<h3 id="org979139f">Abstract Data Types (ADT)</h3>
<div class="outline-text-3" id="text-org979139f">
<p>
These are like user defined types which define what operations can be preformed on them.
The functions body are defined and ho it is done!
</p>

<p>
In short they are a black box
</p>
</div>

<div id="outline-container-org556f703" class="outline-4">
<h4 id="org556f703">A stack ADT</h4>
<div class="outline-text-4" id="text-org556f703">
<p>
A Stack consists of elements of the same type in a sequential order
Some example functions
</p>

<ul class="org-ul">
<li>push insert a element</li>
<li>pop delete a element</li>
<li>isEmpty checks if its empty</li>
<li>isFull checks if its full</li>
<li>initialize creating it with no elements</li>
</ul>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author:  (<a href="mailto:unseen@flake">unseen@flake</a>)</p>
<p class="date">Date: </p>
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 28.2 (<a href="https://orgmode.org">Org</a> mode 9.5.5)</p>
<p class="validation"></p>
</div>
</body>
</html>
